In [2]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [3]:
# Seriesを2つ作ります
ser1 = Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
# 足し合わせてみる
ser1 + ser2
# NaNが自動的に追加されます。　どちらか一方しかない場合、NaNになる。

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [6]:
# DataFrameの場合。
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [7]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [8]:
# 足し合わせるとどうなるでしょうか？ 共通項以外はNaNになってしまう。
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [10]:
# addというメソッドを使うと、NaNを置き換えられます。
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [14]:
# SF-Bだけ元々どちらにも存在しないので、置き換わりようがありません。 よってNaNとなる。

In [20]:
# DataFrameとSeriesの計算もできます。

In [9]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [40]:
# 最初の行で、Seriesを作ります。
ser3 = dframe2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [11]:
# 行ごとに引き算されているのがわかります。 numpyのブロードキャストの様。
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [41]:
dframe3 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'))
dframe3

   A  D  C
0  0  1  2
1  3  4  5
2  6  7  8

In [50]:
dframe3.add(ser3,fill_value=0)　　　#fill_varueを指定できるのはDataframe,Series同士の演算のみ？

NotImplementedError: fill_value 0 not supported

In [27]:
pd.__version__

'0.20.2'